---
layout: post
title: '如何在Erlang的List中移除element?'
date: 2012-11-28
wordpress_id: 1062
permalink: /blogs/1062
comments: true
categories:
- Erlang
tags:
- element
- Erlang
- List
- remove

---
Erlang的BIF似乎没有对应的函数，不过可以很方便的达到这一目的。

1. 使用“--”操作符
<pre class="prettyprint linenums">
1> List1 = [1,3,2].
[1,3,2]
2> List2 = [3,5].
[3,5]
3> List3 = List1 -- List2.
[1,2]
4> List4 = [1,3,2,3].
[1,3,2,3]
5> List4 -- List2.
[1,2,3]
</pre>

2. 自定义函数
删除List中的第N项
<pre class="prettyprint linenums">
del_nth_from_list(List, N) ->
  {L1, [_|L2]} = lists:split(N-1, List),
  L1 ++ L2.
</pre>

从List删除所有指定的项
<pre class="prettyprint linenums">
del_all_occurences(List, Elem) ->
  [E || E <- List, E =/= Elem].
</pre>
